// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// --створити масив з:
//     - з 5 числових значень
let arr1 = [];
for (let i = 0; i < 5; i++) {
    arr1[i] = Math.floor(Math.random()*10);
    console.log(arr1[i]);
}
// - з 5 стічкових значень

let arr2 = ['Jazz', 'Rock', 'Blues', 'Heavy Metal', 'Gospel'];
for (let arr2Key in arr2) {
    console.log(arr2[arr2Key]);
}
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
let arr3 = ['Wonderful World', 5, 10, true, false];
for (let arr2Key in arr3) {
    console.log(arr3[arr2Key]);
}

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консольд
let arr4 = [];
for (let i = 0; i < 5; i++) {
    arr4[i] = Math.floor(Math.random()*10);
    console.log(arr4[i]);
}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for (i = 0; i < 10; i++) {
    document.write(`<div>Random text </div>`);
}
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
for (i = 0; i < 10; i++) {
    document.write(`<div>Random text ${i}</div>`);
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
i = 0;
while (i < 20) {
    document.write(`<h1>Random header text</h1>`);
    i++;
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
i = 0;
while (i < 20) {
    document.write(`<h1>Random header text ${i}</h1>`);
    i++;
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let arr5 = [];
for (let i = 0; i < 10; i++) {
    arr1[i] = Math.floor(Math.random()*10);
    console.log(arr5[i]);
}
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let arr6 = [
    'The Tall Blond Man',
    'The Goat',
    'Fugitives',
    'ComDads',
    'The Toy',
    'The Return of the Tall Blond',
    'Distracted',
    'The Wild Goose Chase',
    'The Troubles of Alfred',
    'I\'m Losing My Temper'
];
for (let arr2Key in arr6) {
    console.log(arr6[arr2Key]);
}
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let arr7 = [
    'Pierre Richard',
    'artist',
    1934,
    16,
    8,
    true,
    'France',
    false,
    true,
    87
];
for (let arr2Key in arr7) {
    console.log(arr7[arr2Key]);
}
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
for (i = 0; i < 10; i++){
    let tp = typeof (arr7[i]);
    if(tp === 'boolean') console.log(arr7[i]);
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
for (i = 0; i < 10; i++){
    let tp = typeof (arr7[i]);
    if(tp === 'number') console.log(arr7[i]);
}

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
for (i = 0; i < 10; i++){
    let tp = typeof (arr7[i]);
    if(tp === 'string') console.log(arr7[i]);
}
